<!-- attach-outputs:plan-nodes-prod.txt -->
  <!-- Output: plan-nodes-prod.txt -->
  #### plan-nodes-prod.txt 📖: `test: success, prod: success`

  **Last updated:** Jan 2, 2026, 05:08 AM UTC

  <details><summary>Show Contents</summary>

  ```

  
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # proxmox_virtual_environment_download_file.talos_iso["nuc-g2p-1"] will be created
  + resource "proxmox_virtual_environment_download_file" "talos_iso" {
      + content_type        = "iso"
      + datastore_id        = "local"
      + file_name           = (known after apply)
      + id                  = (known after apply)
      + node_name           = "nuc-g2p-1"
      + overwrite           = true
      + overwrite_unmanaged = false
      + size                = (known after apply)
      + upload_timeout      = 600
      + url                 = (known after apply)
      + verify              = true
    }

  # proxmox_virtual_environment_download_file.talos_iso["nuc-g2p-2"] will be created
  + resource "proxmox_virtual_environment_download_file" "talos_iso" {
      + content_type        = "iso"
      + datastore_id        = "local"
      + file_name           = (known after apply)
      + id                  = (known after apply)
      + node_name           = "nuc-g2p-2"
      + overwrite           = true
      + overwrite_unmanaged = false
      + size                = (known after apply)
      + upload_timeout      = 600
      + url                 = (known after apply)
      + verify              = true
    }

  # proxmox_virtual_environment_download_file.talos_iso["nuc-g3p-1"] will be created
  + resource "proxmox_virtual_environment_download_file" "talos_iso" {
      + content_type        = "iso"
      + datastore_id        = "local"
      + file_name           = (known after apply)
      + id                  = (known after apply)
      + node_name           = "nuc-g3p-1"
      + overwrite           = true
      + overwrite_unmanaged = false
      + size                = (known after apply)
      + upload_timeout      = 600
      + url                 = (known after apply)
      + verify              = true
    }

  # proxmox_virtual_environment_download_file.talos_iso["nuc-g3p-2"] will be created
  + resource "proxmox_virtual_environment_download_file" "talos_iso" {
      + content_type        = "iso"
      + datastore_id        = "local"
      + file_name           = (known after apply)
      + id                  = (known after apply)
      + node_name           = "nuc-g3p-2"
      + overwrite           = true
      + overwrite_unmanaged = false
      + size                = (known after apply)
      + upload_timeout      = 600
      + url                 = (known after apply)
      + verify              = true
    }

  # talos_image_factory_schematic.this will be created
  + resource "talos_image_factory_schematic" "this" {
      + id        = (known after apply)
      + schematic = <<-EOT
            "customization":
              "extraKernelArgs":
              - "vga=792"
              - "-talos.halt_if_installed"
              "systemExtensions":
                "officialExtensions":
                - "siderolabs/qemu-guest-agent"
        EOT
    }

  # module.cluster.data.talos_client_configuration.talosconfig will be read during apply
  # (config refers to values not yet known)
 <= data "talos_client_configuration" "talosconfig" {
      + client_configuration = (known after apply)
      + cluster_name         = "tiles-test"
      + endpoints            = [
          + "10.0.192.11",
        ]
      + id                   = (known after apply)
      + talos_config         = (sensitive value)
    }

  # module.cluster.data.talos_machine_configuration.machineconfig_cp will be read during apply
  # (config refers to values not yet known)
 <= data "talos_machine_configuration" "machineconfig_cp" {
      + cluster_endpoint      = "https://10.0.192.10:6443"
      + cluster_name          = "tiles-test"
      + config_patches        = [
          + <<-EOT
                version: v1alpha1
                cluster:
                  network:
                    # cilium will become our CNI.
                    cni:
                      name: none
                  controllerManager:
                    extraArgs:
                      # Listen to more than localhost so we can scrape from Alloy.
                      bind-address: 0.0.0.0
                  scheduler:
                    extraArgs:
                      # Listen to more than localhost so we can scrape from Alloy.
                      bind-address: 0.0.0.0
                  apiServer:
                    extraArgs:
                      # Listen to more than localhost so we can scrape from Alloy.
                      bind-address: 0.0.0.0
                  proxy:
                    # Cilium will replace the proxy
                    disabled: true
                machine:
                  sysctls:
                    user.max_user_namespaces: "8192"
                  # https://www.talos.dev/v1.10/talos-guides/configuration/containerd/#exposing-metrics
                  files:
                    - content: |
                        [metrics]
                          address = "0.0.0.0:11234"
                      path: /etc/cri/conf.d/20-customization.part
                      op: create
                  features:
                    rbac: true
                    diskQuotaSupport: true
                    hostDNS:
                      enabled: true
                      resolveMemberNames: true
                      forwardKubeDNSToHost: false
                    imageCache:
                      localEnabled: true
                  install:
                    # wipe: true
                    extraKernelArgs:
                      # 1024x768 for the dashboard:
                      - vga=792
                      # Disable predictable network interface names (use eth0, eth1, etc.)
                      - net.ifnames=0
                      - -talos.halt_if_installed
            EOT,
        ]
      + id                    = (known after apply)
      + machine_configuration = (sensitive value)
      + machine_secrets       = (known after apply)
      + machine_type          = "controlplane"
    }

  # module.cluster.data.talos_machine_configuration.machineconfig_worker will be read during apply
  # (config refers to values not yet known)
 <= data "talos_machine_configuration" "machineconfig_worker" {
      + cluster_endpoint      = "https://10.0.192.10:6443"
      + cluster_name          = "tiles-test"
      + config_patches        = [
          + <<-EOT
                version: v1alpha1
                cluster:
                  network:
                    # cilium will become our CNI.
                    cni:
                      name: none
                  controllerManager:
                    extraArgs:
                      # Listen to more than localhost so we can scrape from Alloy.
                      bind-address: 0.0.0.0
                  scheduler:
                    extraArgs:
                      # Listen to more than localhost so we can scrape from Alloy.
                      bind-address: 0.0.0.0
                  apiServer:
                    extraArgs:
                      # Listen to more than localhost so we can scrape from Alloy.
                      bind-address: 0.0.0.0
                  proxy:
                    # Cilium will replace the proxy
                    disabled: true
                machine:
                  sysctls:
                    user.max_user_namespaces: "8192"
                  # https://www.talos.dev/v1.10/talos-guides/configuration/containerd/#exposing-metrics
                  files:
                    - content: |
                        [metrics]
                          address = "0.0.0.0:11234"
                      path: /etc/cri/conf.d/20-customization.part
                      op: create
                  features:
                    rbac: true
                    diskQuotaSupport: true
                    hostDNS:
                      enabled: true
                      resolveMemberNames: true
                      forwardKubeDNSToHost: false
                    imageCache:
                      localEnabled: true
                  install:
                    # wipe: true
                    extraKernelArgs:
                      # 1024x768 for the dashboard:
                      - vga=792
                      # Disable predictable network interface names (use eth0, eth1, etc.)
                      - net.ifnames=0
                      - -talos.halt_if_installed
            EOT,
        ]
      + id                    = (known after apply)
      + machine_configuration = (sensitive value)
      + machine_secrets       = (known after apply)
      + machine_type          = "worker"
    }

  # module.cluster.onepassword_item.misc_config[0] will be created
  + resource "onepassword_item" "misc_config" {
      + category = "secure_note"
      + id       = (known after apply)
      + password = (sensitive value)
      + title    = "tiles-test-misc-config"
      + uuid     = (known after apply)
      + vault    = "lyyqeg3pe6dvqdeb5hbiu7b76y"

      + section {
          + id    = (known after apply)
          + label = "config"

          + field {
              + id    = (known after apply)
              + label = "pod_cidr"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "targetRevision"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "cluster_name"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "external_ip_cidr"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "vault_name"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "project_id"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "loki_nfs_path"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "mimir_nfs_path"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "loki_nfs_uid"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "mimir_nfs_uid"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "nfs_server"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "service_cidr"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "control_plane_vip"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "control_plane_vip_link"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "talos_install_image"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "control_plane_ips"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "bootstrap_ip"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "worker_ips"
              + type  = "STRING"
              + value = (sensitive value)
            }
        }
      + section {
          + id    = (known after apply)
          + label = "metadata"

          + field {
              + id    = (known after apply)
              + label = "source"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "root_module"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "module"
              + type  = "STRING"
              + value = (sensitive value)
            }
        }
    }

  # module.cluster.onepassword_item.talosconfig[0] will be created
  + resource "onepassword_item" "talosconfig" {
      + category   = "secure_note"
      + id         = (known after apply)
      + note_value = (sensitive value)
      + password   = (sensitive value)
      + title      = "tiles-test-talosconfig"
      + uuid       = (known after apply)
      + vault      = "lyyqeg3pe6dvqdeb5hbiu7b76y"

      + section {
          + id    = (known after apply)
          + label = "metadata"

          + field {
              + id    = (known after apply)
              + label = "source"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "root_module"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "module"
              + type  = "STRING"
              + value = (sensitive value)
            }
        }
    }

  # module.cluster.talos_machine_secrets.this will be created
  + resource "talos_machine_secrets" "this" {
      + client_configuration = (known after apply)
      + id                   = (known after apply)
      + machine_secrets      = (known after apply)
      + talos_version        = "v1.12"
    }

  # module.cluster.module.k8s.cloudflare_dns_record.delegation[0] will be created
  + resource "cloudflare_dns_record" "delegation" {
      + comment             = "Managed by Terraform"
      + comment_modified_on = (known after apply)
      + content             = (known after apply)
      + created_on          = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "tiles-test"
      + proxiable           = (known after apply)
      + proxied             = false
      + settings            = (known after apply)
      + tags                = (known after apply)
      + tags_modified_on    = (known after apply)
      + ttl                 = 300
      + type                = "NS"
      + zone_id             = "73b4d912118a49df40acea58c4983678"
    }

  # module.cluster.module.k8s.cloudflare_dns_record.delegation[1] will be created
  + resource "cloudflare_dns_record" "delegation" {
      + comment             = "Managed by Terraform"
      + comment_modified_on = (known after apply)
      + content             = (known after apply)
      + created_on          = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "tiles-test"
      + proxiable           = (known after apply)
      + proxied             = false
      + settings            = (known after apply)
      + tags                = (known after apply)
      + tags_modified_on    = (known after apply)
      + ttl                 = 300
      + type                = "NS"
      + zone_id             = "73b4d912118a49df40acea58c4983678"
    }

  # module.cluster.module.k8s.cloudflare_dns_record.delegation[2] will be created
  + resource "cloudflare_dns_record" "delegation" {
      + comment             = "Managed by Terraform"
      + comment_modified_on = (known after apply)
      + content             = (known after apply)
      + created_on          = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "tiles-test"
      + proxiable           = (known after apply)
      + proxied             = false
      + settings            = (known after apply)
      + tags                = (known after apply)
      + tags_modified_on    = (known after apply)
      + ttl                 = 300
      + type                = "NS"
      + zone_id             = "73b4d912118a49df40acea58c4983678"
    }

  # module.cluster.module.k8s.cloudflare_dns_record.delegation[3] will be created
  + resource "cloudflare_dns_record" "delegation" {
      + comment             = "Managed by Terraform"
      + comment_modified_on = (known after apply)
      + content             = (known after apply)
      + created_on          = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "tiles-test"
      + proxiable           = (known after apply)
      + proxied             = false
      + settings            = (known after apply)
      + tags                = (known after apply)
      + tags_modified_on    = (known after apply)
      + ttl                 = 300
      + type                = "NS"
      + zone_id             = "73b4d912118a49df40acea58c4983678"
    }

  # module.cluster.module.k8s.google_dns_managed_zone_iam_member.cert_manager_dns01_public will be created
  + resource "google_dns_managed_zone_iam_member" "cert_manager_dns01_public" {
      + etag         = (known after apply)
      + id           = (known after apply)
      + managed_zone = "tiles-test"
      + member       = "serviceAccount:sa-tiles-test-cert-manager@tiles-test-main-11ed.iam.gserviceaccount.com"
      + project      = "tiles-test-main-11ed"
      + role         = "roles/dns.admin"
    }

  # module.cluster.module.k8s.google_dns_managed_zone_iam_member.external_dns_public will be created
  + resource "google_dns_managed_zone_iam_member" "external_dns_public" {
      + etag         = (known after apply)
      + id           = (known after apply)
      + managed_zone = "tiles-test"
      + member       = "serviceAccount:sa-tiles-test-external-dns@tiles-test-main-11ed.iam.gserviceaccount.com"
      + project      = "tiles-test-main-11ed"
      + role         = "roles/dns.admin"
    }

  # module.cluster.module.k8s.google_project_iam_member.cert_manager_dns01_dns_reader will be created
  + resource "google_project_iam_member" "cert_manager_dns01_dns_reader" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:sa-tiles-test-cert-manager@tiles-test-main-11ed.iam.gserviceaccount.com"
      + project = "tiles-test-main-11ed"
      + role    = "roles/dns.reader"
    }

  # module.cluster.module.k8s.google_project_iam_member.external_dns_dns_reader will be created
  + resource "google_project_iam_member" "external_dns_dns_reader" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:sa-tiles-test-external-dns@tiles-test-main-11ed.iam.gserviceaccount.com"
      + project = "tiles-test-main-11ed"
      + role    = "roles/dns.reader"
    }

  # module.cluster.module.k8s.google_service_account.cert_manager_dns01 will be created
  + resource "google_service_account" "cert_manager_dns01" {
      + account_id   = "sa-tiles-test-cert-manager"
      + description  = "Service account for tiles-test cert-manager to perform DNS01 ACME challenges"
      + disabled     = false
      + display_name = "tiles-test cert-manager DNS01 Solver"
      + email        = "sa-tiles-test-cert-manager@tiles-test-main-11ed.iam.gserviceaccount.com"
      + id           = (known after apply)
      + member       = "serviceAccount:sa-tiles-test-cert-manager@tiles-test-main-11ed.iam.gserviceaccount.com"
      + name         = (known after apply)
      + project      = "tiles-test-main-11ed"
      + unique_id    = (known after apply)
    }

  # module.cluster.module.k8s.google_service_account.external_dns will be created
  + resource "google_service_account" "external_dns" {
      + account_id   = "sa-tiles-test-external-dns"
      + description  = "Service account for tiles-test external-dns to manage DNS records"
      + disabled     = false
      + display_name = "tiles-test external-dns"
      + email        = "sa-tiles-test-external-dns@tiles-test-main-11ed.iam.gserviceaccount.com"
      + id           = (known after apply)
      + member       = "serviceAccount:sa-tiles-test-external-dns@tiles-test-main-11ed.iam.gserviceaccount.com"
      + name         = (known after apply)
      + project      = "tiles-test-main-11ed"
      + unique_id    = (known after apply)
    }

  # module.cluster.module.k8s.google_service_account_key.cert_manager_dns01_sa_key will be created
  + resource "google_service_account_key" "cert_manager_dns01_sa_key" {
      + id                 = (known after apply)
      + key_algorithm      = "KEY_ALG_RSA_2048"
      + name               = (known after apply)
      + private_key        = (sensitive value)
      + private_key_type   = "TYPE_GOOGLE_CREDENTIALS_FILE"
      + public_key         = (known after apply)
      + public_key_type    = "TYPE_X509_PEM_FILE"
      + service_account_id = (known after apply)
      + valid_after        = (known after apply)
      + valid_before       = (known after apply)
    }

  # module.cluster.module.k8s.google_service_account_key.external_dns_sa_key will be created
  + resource "google_service_account_key" "external_dns_sa_key" {
      + id                 = (known after apply)
      + key_algorithm      = "KEY_ALG_RSA_2048"
      + name               = (known after apply)
      + private_key        = (sensitive value)
      + private_key_type   = "TYPE_GOOGLE_CREDENTIALS_FILE"
      + public_key         = (known after apply)
      + public_key_type    = "TYPE_X509_PEM_FILE"
      + service_account_id = (known after apply)
      + valid_after        = (known after apply)
      + valid_before       = (known after apply)
    }

  # module.cluster.module.k8s.htpasswd_password.apprise_admin will be created
  + resource "htpasswd_password" "apprise_admin" {
      + apr1     = (known after apply)
      + bcrypt   = (known after apply)
      + id       = (known after apply)
      + password = (sensitive value)
      + sha256   = (known after apply)
      + sha512   = (known after apply)
    }

  # module.cluster.module.k8s.onepassword_item.apprise_admin will be created
  + resource "onepassword_item" "apprise_admin" {
      + category = "login"
      + id       = (known after apply)
      + password = (sensitive value)
      + title    = "tiles-test-apprise-admin"
      + url      = "https://apprise.tiles-test.symmatree.com"
      + username = "apprise"
      + uuid     = (known after apply)
      + vault    = "lyyqeg3pe6dvqdeb5hbiu7b76y"

      + section {
          + id    = (known after apply)
          + label = "credentials"

          + field {
              + id    = (known after apply)
              + label = ".htpasswd"
              + type  = "STRING"
              + value = (sensitive value)
            }
        }
      + section {
          + id    = (known after apply)
          + label = "metadata"

          + field {
              + id    = (known after apply)
              + label = "source"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "root_module"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "module"
              + type  = "STRING"
              + value = (sensitive value)
            }
        }
    }

  # module.cluster.module.k8s.onepassword_item.apprise_env will be created
  + resource "onepassword_item" "apprise_env" {
      + category = "secure_note"
      + id       = (known after apply)
      + password = (sensitive value)
      + title    = "tiles-test-apprise-env"
      + uuid     = (known after apply)
      + vault    = "lyyqeg3pe6dvqdeb5hbiu7b76y"

      + section {
          + id    = (known after apply)
          + label = "config"

          + field {
              + id    = (known after apply)
              + label = "SECRET_KEY"
              + type  = "STRING"
              + value = (sensitive value)
            }
        }
      + section {
          + id    = (known after apply)
          + label = "metadata"

          + field {
              + id    = (known after apply)
              + label = "source"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "root_module"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "module"
              + type  = "STRING"
              + value = (sensitive value)
            }
        }
    }

  # module.cluster.module.k8s.onepassword_item.cert_manager_dns01_sa_key will be created
  + resource "onepassword_item" "cert_manager_dns01_sa_key" {
      + category = "secure_note"
      + id       = (known after apply)
      + password = (sensitive value)
      + title    = "tiles-test-cert-manager-dns01-sa-key"
      + uuid     = (known after apply)
      + vault    = "lyyqeg3pe6dvqdeb5hbiu7b76y"

      + section {
          + id    = (known after apply)
          + label = "credentials"

          + field {
              + id    = (known after apply)
              + label = "private_key.json"
              + type  = "CONCEALED"
              + value = (sensitive value)
            }
        }
      + section {
          + id    = (known after apply)
          + label = "metadata"

          + field {
              + id    = (known after apply)
              + label = "source"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "root_module"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "module"
              + type  = "STRING"
              + value = (sensitive value)
            }
        }
    }

  # module.cluster.module.k8s.onepassword_item.external_dns_clouddns_sa_key will be created
  + resource "onepassword_item" "external_dns_clouddns_sa_key" {
      + category = "secure_note"
      + id       = (known after apply)
      + password = (sensitive value)
      + title    = "tiles-test-external-dns-clouddns-sa-key"
      + uuid     = (known after apply)
      + vault    = "lyyqeg3pe6dvqdeb5hbiu7b76y"

      + section {
          + id    = (known after apply)
          + label = "credentials"

          + field {
              + id    = (known after apply)
              + label = "credential.json"
              + type  = "CONCEALED"
              + value = (sensitive value)
            }
        }
      + section {
          + id    = (known after apply)
          + label = "metadata"

          + field {
              + id    = (known after apply)
              + label = "source"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "root_module"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "module"
              + type  = "STRING"
              + value = (sensitive value)
            }
        }
    }

  # module.cluster.module.k8s.random_password.apprise_admin will be created
  + resource "random_password" "apprise_admin" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 24
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = true
      + upper       = true
    }

  # module.cluster.module.k8s.random_password.apprise_env will be created
  + resource "random_password" "apprise_env" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 24
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = true
      + upper       = true
    }

  # module.cluster.module.talos-vm["tiles-test-cp"].proxmox_virtual_environment_vm.main will be created
  + resource "proxmox_virtual_environment_vm" "main" {
      + acpi                                 = true
      + bios                                 = "seabios"
      + boot_order                           = (known after apply)
      + delete_unreferenced_disks_on_destroy = true
      + description                          = "Control - 7411 - tiles-test-cp - 10.0.192.11"
      + id                                   = (known after apply)
      + ipv4_addresses                       = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + keyboard_layout                      = "en-us"
      + mac_addresses                        = (known after apply)
      + migrate                              = false
      + name                                 = "tiles-test-cp"
      + network_interface_names              = (known after apply)
      + node_name                            = "nuc-g3p-2"
      + on_boot                              = true
      + protection                           = false
      + purge_on_destroy                     = true
      + reboot                               = false
      + reboot_after_update                  = true
      + scsi_hardware                        = "virtio-scsi-single"
      + started                              = true
      + stop_on_destroy                      = false
      + tablet_device                        = true
      + tags                                 = []
      + template                             = false
      + timeout_clone                        = 1800
      + timeout_create                       = 1800
      + timeout_migrate                      = 1800
      + timeout_move_disk                    = 1800
      + timeout_reboot                       = 1800
      + timeout_shutdown_vm                  = 1800
      + timeout_start_vm                     = 1800
      + timeout_stop_vm                      = 300
      + vm_id                                = 7411

      + agent {
          + enabled = true
          + timeout = "15m"
          + trim    = false
          + type    = "virtio"
        }

      + cdrom {
          + enabled   = false
          + file_id   = (known after apply)
          + interface = "ide2"
        }

      + cpu {
          + cores      = 2
          + hotplugged = 0
          + limit      = 0
          + numa       = false
          + sockets    = 1
          + type       = "x86-64-v3"
          + units      = (known after apply)
        }

      + disk {
          + aio               = "io_uring"
          + backup            = true
          + cache             = "none"
          + datastore_id      = "local-lvm"
          + discard           = "ignore"
          + file_format       = "raw"
          + interface         = "scsi0"
          + iothread          = true
          + path_in_datastore = (known after apply)
          + replicate         = true
          + size              = 32
          + ssd               = false
        }

      + memory {
          + dedicated      = 5120
          + floating       = 5120
          + keep_hugepages = false
          + shared         = 0
        }

      + network_device {
          + bridge      = "vmbr0"
          + enabled     = true
          + firewall    = true
          + mac_address = "bc:24:11:d0:74:11"
          + model       = "virtio"
          + mtu         = 1
          + queues      = 16
          + rate_limit  = 0
          + vlan_id     = 0
        }

      + operating_system {
          + type = "l26"
        }

      + vga (known after apply)
    }

  # module.cluster.module.talos-vm["tiles-test-cp"].unifi_user.vm_client will be created
  + resource "unifi_user" "vm_client" {
      + allow_existing         = true
      + fixed_ip               = "10.0.192.11"
      + hostname               = (known after apply)
      + id                     = (known after apply)
      + ip                     = (known after apply)
      + local_dns_record       = "tiles-test-cp.local.symmatree.com."
      + mac                    = "bc:24:11:d0:74:11"
      + name                   = "tiles-test-cp"
      + note                   = "Control - 7411 - tiles-test-cp"
      + site                   = (known after apply)
      + skip_forget_on_destroy = false
    }

  # module.cluster.module.talos-vm["tiles-test-wk"].proxmox_virtual_environment_vm.main will be created
  + resource "proxmox_virtual_environment_vm" "main" {
      + acpi                                 = true
      + bios                                 = "seabios"
      + boot_order                           = (known after apply)
      + delete_unreferenced_disks_on_destroy = true
      + description                          = "Worker - 7421 - tiles-test-wk - 10.0.192.21"
      + id                                   = (known after apply)
      + ipv4_addresses                       = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + keyboard_layout                      = "en-us"
      + mac_addresses                        = (known after apply)
      + migrate                              = false
      + name                                 = "tiles-test-wk"
      + network_interface_names              = (known after apply)
      + node_name                            = "nuc-g3p-2"
      + on_boot                              = true
      + protection                           = false
      + purge_on_destroy                     = true
      + reboot                               = false
      + reboot_after_update                  = true
      + scsi_hardware                        = "virtio-scsi-single"
      + started                              = true
      + stop_on_destroy                      = false
      + tablet_device                        = true
      + tags                                 = []
      + template                             = false
      + timeout_clone                        = 1800
      + timeout_create                       = 1800
      + timeout_migrate                      = 1800
      + timeout_move_disk                    = 1800
      + timeout_reboot                       = 1800
      + timeout_shutdown_vm                  = 1800
      + timeout_start_vm                     = 1800
      + timeout_stop_vm                      = 300
      + vm_id                                = 7421

      + agent {
          + enabled = true
          + timeout = "15m"
          + trim    = false
          + type    = "virtio"
        }

      + cdrom {
          + enabled   = false
          + file_id   = (known after apply)
          + interface = "ide2"
        }

      + cpu {
          + cores      = 2
          + hotplugged = 0
          + limit      = 0
          + numa       = false
          + sockets    = 1
          + type       = "x86-64-v3"
          + units      = (known after apply)
        }

      + disk {
          + aio               = "io_uring"
          + backup            = true
          + cache             = "none"
          + datastore_id      = "local-lvm"
          + discard           = "ignore"
          + file_format       = "raw"
          + interface         = "scsi0"
          + iothread          = true
          + path_in_datastore = (known after apply)
          + replicate         = true
          + size              = 32
          + ssd               = false
        }

      + memory {
          + dedicated      = 8192
          + floating       = 8192
          + keep_hugepages = false
          + shared         = 0
        }

      + network_device {
          + bridge      = "vmbr0"
          + enabled     = true
          + firewall    = true
          + mac_address = "bc:24:11:d0:74:21"
          + model       = "virtio"
          + mtu         = 1
          + queues      = 16
          + rate_limit  = 0
          + vlan_id     = 0
        }

      + operating_system {
          + type = "l26"
        }

      + vga (known after apply)
    }

  # module.cluster.module.talos-vm["tiles-test-wk"].unifi_user.vm_client will be created
  + resource "unifi_user" "vm_client" {
      + allow_existing         = true
      + fixed_ip               = "10.0.192.21"
      + hostname               = (known after apply)
      + id                     = (known after apply)
      + ip                     = (known after apply)
      + local_dns_record       = "tiles-test-wk.local.symmatree.com."
      + mac                    = "bc:24:11:d0:74:21"
      + name                   = "tiles-test-wk"
      + note                   = "Worker - 7421 - tiles-test-wk"
      + site                   = (known after apply)
      + skip_forget_on_destroy = false
    }

  # module.cluster.module.k8s.module.dns-public-zone.google_dns_managed_zone.public[0] will be created
  + resource "google_dns_managed_zone" "public" {
      + creation_time    = (known after apply)
      + description      = "Managed by Terraform"
      + dns_name         = "tiles-test.symmatree.com."
      + effective_labels = {
          + "cluster"                    = "tiles-test"
          + "goog-terraform-provisioned" = "true"
          + "name"                       = "tiles-test"
        }
      + force_destroy    = false
      + id               = (known after apply)
      + labels           = {
          + "cluster" = "tiles-test"
          + "name"    = "tiles-test"
        }
      + managed_zone_id  = (known after apply)
      + name             = "tiles-test"
      + name_servers     = (known after apply)
      + project          = "tiles-test-main-11ed"
      + terraform_labels = {
          + "cluster"                    = "tiles-test"
          + "goog-terraform-provisioned" = "true"
          + "name"                       = "tiles-test"
        }
      + visibility       = "public"

      + cloud_logging_config {
          + enable_logging = false
        }

      + dnssec_config (known after apply)
    }

  # module.cluster.module.k8s.module.dns-public-zone.google_dns_record_set.cloud-static-records["/NS"] will be created
  + resource "google_dns_record_set" "cloud-static-records" {
      + id           = (known after apply)
      + managed_zone = "tiles-test"
      + name         = "tiles-test.symmatree.com."
      + project      = "tiles-test-main-11ed"
      + rrdatas      = [
          + "ns.tiles-test.symmatree.com.",
        ]
      + ttl          = 300
      + type         = "NS"
    }

  # module.cluster.module.k8s.module.dns-public-zone.google_dns_record_set.cloud-static-records["localhost/A"] will be created
  + resource "google_dns_record_set" "cloud-static-records" {
      + id           = (known after apply)
      + managed_zone = "tiles-test"
      + name         = "localhost.tiles-test.symmatree.com."
      + project      = "tiles-test-main-11ed"
      + rrdatas      = [
          + "127.0.0.1",
        ]
      + ttl          = 300
      + type         = "A"
    }

  # module.cluster.module.k8s.module.dns-public-zone.google_dns_record_set.cloud-static-records["ns/A"] will be created
  + resource "google_dns_record_set" "cloud-static-records" {
      + id           = (known after apply)
      + managed_zone = "tiles-test"
      + name         = "ns.tiles-test.symmatree.com."
      + project      = "tiles-test-main-11ed"
      + rrdatas      = [
          + "127.0.0.1",
        ]
      + ttl          = 300
      + type         = "A"
    }

Plan: 35 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + all_node_ips         = [
      + "10.0.192.11",
      + "10.0.192.21",
    ]
  + bootstrap_node       = "10.0.192.11"
  + cluster_endpoint     = "https://10.0.192.10:6443"
  + control_plane_config = (sensitive value)
  + control_plane_ips    = [
      + "10.0.192.11",
    ]
  + control_plane_vip    = "10.0.192.10"
  + schematic_id         = (known after apply)
  + talosconfig          = (sensitive value)
  + vms_started          = true
  + worker_config        = (sensitive value)

  ```

  </details>
  
  